# Напишіть програму, яка запитує у користувача його ім'я та вік, а потім
# виводить на екран привітання у форматі: "Привіт, [ім'я]! Тобі [вік] років."
# Використовуйте команду input для отримання даних від користувача та команду
# print для виведення привітання.

# Приклад висновку:
# Введіть ваше ім'я: Олексій
# Введіть ваш вік: 25
# Привіт Олексій! Тобі 25 років.


def greetings(name: str, age: int) -> str:
    return f'Привіт, {name}! Тобі {age} років.'


name = input('Hi! Input your name: ').title()
age = int(input('Input your age: '))
print(greetings(name, age))
